package TaskB.Chapter1;

/**
 * Вариант B
 * Ввести с консоли n целых чисел. На консоль вывести:
 * 1. Четные и нечетные числа.
 * 2. Наибольшее и наименьшее число.
 * 3. Числа, которые делятся на 3 или на 9.
 * 4. Числа, которые делятся на 5 и на 7.
 * 5. Все трехзначные числа, в десятичной записи которых нет одинаковых
 * цифр.
 * 6. Простые числа.
 * 7. Отсортированные числа в порядке возрастания и убывания.
 * 8. Числа в порядке убывания частоты встречаемости чисел.
 * 9. «Счастливые» числа.
 * 10. Числа-палиндромы, значения которых в прямом и обратном порядке совпа-
 * дают.
 * 11. Элементы, которые равны полусумме соседних элементов.
 */
public class TaskB1 {
}
