package TaskAcademy.Lesson4;

/**
 * A2. Напишите также метод static void buildOneDimArray(String line), который:
 * формирует из строки line массив вещественных чисел,
 * (можно скопировать для этого класс InOut, написанный в jd01_03 Задание A)
 * выводит в 5 колонок этот массив с названием V и индексами (тоже InOut),
 * например V[ 1 ]=12,234 V[ 2 ]=2,345 и т.д.
 * сортирует этот массив по возрастанию (см. Helper.sort в jd01_03 Задание B)
 * еще раз выводит его (см. InOut), но уже в 4 колонки с заголовками и тем же названием
 * выполняет вычисление новых (после сортировки) индексов первого и последнего элемента
 * исходного массива и печатает их в виде:
 * Index of first element=2
 * Index of last element=7
 */
public class TaskA2 {

}
